function negrito() {
    "use strict";
    var
        letters = ["a", "b", "c", "d", "e", "f", "g", "h", "i", "j", "k", "l", "m", "n", "o", "p", "q", "r", "s", "t", "u", "v", "w", "x", "y", "z", "0", "1", "2", "3", "4", "5", "6", "7", "8", "9", "A", "B", "C", "D", "E", "F", "G", "H", "I", "J", "K", "L", "M", "N", "O", "P", "Q", "R", "S", "T", "U", "V", "W", "X", "Y", "Z", ".", ",", ":", ";", " ", "!", ")", "(", "*", "&", "%", "#", "@", ">", "<", "=", "[", "]", "{", "}", "?", "/", "°", "-", "+", "'", '"', "á", "é", "í", "ó", "ú", "à", "è", "ì", "ò", "ù"],
        negrito = ["𝗮", "𝗯", "𝗰", "𝗱", "𝗲", "𝗳", "𝗴", "𝗵", "𝗶", "𝗷", "𝗸", "𝗹", "𝗺", "𝗻", "𝗼", "𝗽", "𝗾", "𝗿", "𝘀", "𝘁", "𝘂", "𝘃", "𝘄", "𝘅", "𝘆", "𝘇", "𝟬", "𝟭", "𝟮", "𝟯", "𝟰", "𝟱", "𝟲", "𝟳", "𝟴", "𝟵", "𝗔", "𝗕", "𝗖", "𝗗", "𝗘", "𝗙", "𝗚", "𝗛", "𝗜", "𝗝", "𝗞", "𝗟", "𝗠", "𝗡", "𝗢", "𝗣", "𝗤", "𝗥", "𝗦", "𝗧", "𝗨", "𝗩", "𝗪", "𝗫", "𝗬", "𝗭", ".", ",", ":", ";", " ", "!", ")", "(", "*", "&", "%", "#", "@", ">", "<", "=", "[", "]", "{", "}", "?", "/", "°", "-", "+", "'", '"', "á", "é", "í", "ó", "ú", "à", "è", "ì", "ò", "ù"];

    var txt = document.getElementById("textarea").value.trim().split(""),
        code = ""

    for (var i in txt) {
        code += negrito[letters.indexOf(txt[i])]
    }

    var conv = code.split("undefined")
    document.getElementById("result").value = conv
}